#include <bits/stdc++.h>
using namespace std;
int main() {
	while(1) {
		double x1_4,x2_4,x3_4,y1_4,y2_4,y3_4,a_4,b_4,c_4;
		cout<<"请输入三组(x,y)坐标"<<endl;
		cout<<endl;
		cout<<"第一组："<<endl;
		cout<<"x=";
		cin>>x1_4;
		cout<<"y=";
		cin>>y1_4;
		cout<<endl;
		cout<<"第二组："<<endl;
		cout<<"x=";
		cin>>x2_4;
		cout<<"y=";
		cin>>y2_4;
		cout<<endl;
		cout<<"第三组："<<endl;
		cout<<"x=";
		cin>>x3_4;
		cout<<"y=";
		cin>>y3_4;
		cout<<endl;
		a_4=((y1_4-y2_4)*(x2_4-x3_4)-(y2_4-y3_4)*(x1_4-x2_4))/((x1_4-x3_4)*(x1_4-x2_4)*(x2_4-x3_4));
		b_4=(y1_4-y2_4)/(x1_4-x2_4)-a_4*(x1_4+x2_4);
		c_4=y1_4-a_4*x1_4*x1_4-b_4*x1_4;
		cout<<"a="<<a_4<<"   "<<"b="<<b_4<<"   "<<"c="<<c_4<<endl;
		
		cout<<"所以，你要的二次函数的解析式是："<<"y=";
		
		if(a_4==1){
			cout<<"x^2";
		} else if(a_4==0){
			 
		} else{
			cout<<a_4<<"x^2";
		}
		
		if(b_4==1){
			cout<<"x";
		} else if(b_4==0){
			 
		} else{
			cout<<b_4<<"x";
		}
		
		if(c_4!=0){
			cout<<c_4<<endl;
		}
		//<<a_4<<"x^2+"<<b_4<<"x+"<<c_4<<endl;
		
		/*
		if(a_4!=1&&0) {
			if(b_4>0&&c_4>0)cout<<"所以，你要的二次函数的解析式是："<<"y="<<a_4<<"x^2+"<<b_4<<"x+"<<c_4<<endl;
			if(b_4<0&&c_4>0)cout<<"所以，你要的二次函数的解析式是："<<"y="<<a_4<<"x^2"<<b_4<<"x+"<<c_4<<endl;
			if(b_4>0&&c_4<0)cout<<"所以，你要的二次函数的解析式是："<<"y="<<a_4<<"x^2+"<<b_4<<"x"<<c_4<<endl;
			if(b_4<0&&c_4<0)cout<<"所以，你要的二次函数的解析式是："<<"y="<<a_4<<"x^2"<<b_4<<"x"<<c_4<<endl;
			if(b_4==0&&c_4>0)cout<<"所以，你要的二次函数的解析式是："<<"y="<<a_4<<"x^2+"<<c_4<<endl;
			if(b_4==0&&c_4<0)cout<<"所以，你要的二次函数的解析式是："<<"y="<<a_4<<"x^2"<<c_4<<endl;
			if(b_4>0&&c_4==0)cout<<"所以，你要的二次函数的解析式是："<<"y="<<a_4<<"x^2+"<<b_4<<"x"<<endl;
			if(b_4<0&&c_4==0)cout<<"所以，你要的二次函数的解析式是："<<"y="<<a_4<<"x^2"<<b_4<<"x"<<endl;
		} else if(a_4==1) {
			if(b_4>0&&c_4>0)cout<<"所以，你要的二次函数的解析式是："<<"y="<<"x^2+"<<b_4<<"x+"<<c_4<<endl;
			if(b_4<0&&c_4>0)cout<<"所以，你要的二次函数的解析式是："<<"y="<<"x^2"<<b_4<<"x+"<<c_4<<endl;
			if(b_4>0&&c_4<0)cout<<"所以，你要的二次函数的解析式是："<<"y="<<"x^2+"<<b_4<<"x"<<c_4<<endl;
			if(b_4<0&&c_4<0)cout<<"所以，你要的二次函数的解析式是："<<"y="<<"x^2"<<b_4<<"x"<<c_4<<endl;
			if(b_4==0&&c_4>0)cout<<"所以，你要的二次函数的解析式是："<<"y="<<"x^2+"<<c_4<<endl;
			if(b_4==0&&c_4<0)cout<<"所以，你要的二次函数的解析式是："<<"y="<<"x^2"<<c_4<<endl;
			if(b_4>0&&c_4==0)cout<<"所以，你要的二次函数的解析式是："<<"y="<<"x^2+"<<b_4<<"x"<<endl;
			if(b_4<0&&c_4==0)cout<<"所以，你要的二次函数的解析式是："<<"y="<<"x^2"<<b_4<<"x"<<endl;
		} else if(a_4==0) {
			if(b_4>0&&c_4>0)cout<<"所以，你要的二次函数的解析式是："<<"y="<<b_4<<"x+"<<c_4<<endl;
			if(b_4<0&&c_4>0)cout<<"所以，你要的二次函数的解析式是："<<"y="<<b_4<<"x+"<<c_4<<endl;
			if(b_4>0&&c_4<0)cout<<"所以，你要的二次函数的解析式是："<<"y="<<b_4<<"x"<<c_4<<endl;
			if(b_4<0&&c_4<0)cout<<"所以，你要的二次函数的解析式是："<<"y="<<b_4<<"x"<<c_4<<endl;
			if(b_4==0&&c_4>0)cout<<"所以，你要的二次函数的解析式是："<<"y="<<c_4<<endl;
			if(b_4==0&&c_4<0)cout<<"所以，你要的二次函数的解析式是："<<"y="<<c_4<<endl;
			if(b_4>0&&c_4==0)cout<<"所以，你要的二次函数的解析式是："<<"y="<<b_4<<"x"<<endl;
			if(b_4<0&&c_4==0)cout<<"所以，你要的二次函数的解析式是："<<"y="<<b_4<<"x"<<endl;
		}*/
		cout<<endl;
		cout<<endl;
		double jx_4;
		cout<<"你还想继续吗？"<<endl;
		cout<<"想请输入1，不想则输2"<<endl;
		cin>>jx_4;
		if(jx_4==1)continue;
		if(jx_4==2) {
			cout<<"OK,你说了算"<<endl;
			break;
		}
		if(jx_4!=1&&2) {
			cout<<"认真点下次，这次别怪我,把你取消了啊"<<endl;
			break;
		}
	}
	return 0;
}
